# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Lars\Documents\PSoC Creator\Workspace01\P4_SingleDiode.cydsn\PSoC4_Current_Digital_to_Analog_Converter01.cydsn\PSoC4_Current_Digital_to_Analog_Converter01.cyprj
# Date: Wed, 24 Jul 2019 14:16:06 GMT
#set_units -time ns
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Lars\Documents\PSoC Creator\Workspace01\P4_SingleDiode.cydsn\PSoC4_Current_Digital_to_Analog_Converter01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Lars\Documents\PSoC Creator\Workspace01\P4_SingleDiode.cydsn\PSoC4_Current_Digital_to_Analog_Converter01.cydsn\PSoC4_Current_Digital_to_Analog_Converter01.cyprj
# Date: Wed, 24 Jul 2019 14:16:04 GMT
