# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Lars\Documents\PSoC Creator\Workspace01\PSOC4_ForwardVoltageTSEP.cydsn\PSOC4_ForwardVoltageTSEP.cyprj
# Date: Mon, 23 Sep 2019 07:50:09 GMT
#set_units -time ns
create_clock -name {ADC_SAR_intClock(FFB)} -period 111.11111111111109 -waveform {0 55.5555555555555} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {SPIS_SCBCLK(FFB)} -period 27.777777777777771 -waveform {0 13.8888888888889} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 27.777777777777771 -waveform {0 13.8888888888889} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 27.777777777777771 -waveform {0 13.8888888888889} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 27.777777777777771 -waveform {0 13.8888888888889} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 27.777777777777771 -waveform {0 13.8888888888889} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_SAR_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]
create_generated_clock -name {SPIS_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Lars\Documents\PSoC Creator\Workspace01\PSOC4_ForwardVoltageTSEP.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Lars\Documents\PSoC Creator\Workspace01\PSOC4_ForwardVoltageTSEP.cydsn\PSOC4_ForwardVoltageTSEP.cyprj
# Date: Mon, 23 Sep 2019 07:50:06 GMT
